app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
   @page = (params[:page] || 1).to_i
   skip = (@page - 1) * 25
   @comments = Comment.order(created_at: :desc).limit(25).offset(skip).all

INSERT INTO "comments" ("comment", "piece_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "MyText"], ["piece_id", 980190962], ["created_at", "2017-08-21 22:44:33.399863"], ["updated_at", "2017-08-21 22:44:33.399863"]]
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save