app/controllers/pieces_controller.rb

SELECT "pieces".* FROM "pieces"
---
  def index
    @pieces = Piece.all

INSERT INTO "pieces" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "MyString"], ["url", "MyString"], ["created_at", "2017-08-21 22:44:33.302938"], ["updated_at", "2017-08-21 22:44:33.302938"]]
---
  def create
    @piece = Piece.new(piece_params)

    respond_to do |format|
      if @piece.save

DELETE FROM "pieces" WHERE "pieces"."id" = $1  [["id", 980190962]]
---
  def destroy
    @piece.destroy

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_piece
      @piece = Piece.find(params[:id])