app/controllers/sessions_controller.rb

  def login_attempt
    authorized_user = User.find_by(name: params[:username]).authenticate(params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bob"], ["LIMIT", 1]]